# IsValidConceptualConstructionTypeElement Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassLevelData..::..IsValidConceptualConstructionTypeElement Method
MassLevelData Class See Also
---
Checks if the ElementId is an acceptable conceptual construction type ElementId for the MassLevelData (Mass Floor).
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsValidConceptualConstructionTypeElement(
	ElementId id
)
```

Visual Basic
---
```text
Public Function IsValidConceptualConstructionTypeElement ( _
	id As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidConceptualConstructionTypeElement(
	ElementId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..ElementId The ElementId to be checked.
# ### Return Value
True if the ElementId is an acceptable conceptual construction type ElementId, false otherwise.
# Remarks
In the case that 'conceptualConstructionIsByEnergyData' is true, invalidElementId is also acceptable input.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace